In [ ]:
!pip install pandas

In [ ]:
import numpy as np
import pandas as pd

#### Working with Pandas Series

In [ ]:
labels = ['a','b', 'c', 'd']
list1 = [10, 20, 30, 40]
arr = np.array(list1)
dict1 = {'a':10, 'b':20, 'c':30, 'd':40}

In [ ]:
series = pd.Series(list1)
type(series)

In [ ]:
series

In [ ]:
series[2]

In [ ]:
series = pd.Series(data=list1)
series = pd.Series(data=list1, index=labels)
series

In [ ]:
series['b']

In [ ]:
pd.Series(arr, index=labels) # from Numpy array

In [ ]:
pd.Series(dict1) # from dict

In [ ]:
days = ['Monday','Tuesday','Wednesday','Thursday']
labels = [1,2,3,4]
day_series = pd.Series(days, index=labels)
day_series

In [ ]:
groceries = {'bananas':6, 'apples':4, 'oranges':12}
groceries_series = pd.Series(groceries)
groceries_series

In [ ]:
groceries_series['bananas']

In [ ]:
groceries_series2 = pd.Series([4, 3, 6, 2],['bananas', 'apples', 'oranges', 'pineapple'])
groceries_series2

In [ ]:
all_groceries = groceries_series + groceries_series2
all_groceries

In [ ]:
all_groceries['pear'] = 9
all_groceries

In [ ]:
all_groceries.add(3)

In [ ]:
all_groceries.min()

In [ ]:
all_groceries.max()

In [ ]:
all_groceries.sum()

In [ ]:
all_groceries

In [ ]:
all_groceries.sort_values()

In [ ]:
all_groceries.sort_index()

In [ ]:
all_groceries

In [ ]:
all_groceries.isnull()

In [ ]:
all_groceries.notnull()

In [ ]:
all_groceries.fillna(6)

In [ ]:
all_groceries.replace(9, 6)

In [ ]:
all_groceries.to_dict()

In [ ]:
all_groceries.to_list()

In [ ]:
all_groceries.to_frame()

In [ ]:
all_groceries.to_frame('quantity')

In [ ]:
!pip install openpyxl

In [ ]:
all_groceries.to_excel('groceries.xlsx')

#### DataFrames

In [89]:
np.random.seed(42)

df = pd.DataFrame(np.random.randn(5,4))
df = pd.DataFrame(np.random.randn(5,4), index=['A','B','C','D','E'])
df = pd.DataFrame(np.random.randn(5,4), index=['A','B','C','D','E'], columns=['W','X','Y','Z'])
type(df)

pandas.core.frame.DataFrame

In [ ]:
df

In [ ]:
type(df['W'])

In [ ]:
col_name = 'X'
df[col_name] # returns a single series

In [ ]:
df.W  # SQL style

In [ ]:
df

In [ ]:
df[['X', 'W']] # returns a DataFrame

In [ ]:
df

In [ ]:
df['K'] = 1 # Add new column
df['K'] = [1,2,3,4,5] # Add new column
df['K'] = df['W']
df['K'] = df['X'] + df['Y']
df

In [ ]:
# changes are not inplace by default, any modification will result in creating and returning a new DataFrame
# when inplace=True is specified, it will result in modifying the actual DataFrame and will not return a new DataFrame
df.drop('K', axis=1, inplace=True) # axis=1 implies column

In [69]:
df

          W         X         Y         Z
A  0.738467  0.171368 -0.115648 -0.301104
B -1.478522 -0.719844 -0.460639  1.057122
C  0.343618 -1.763040  0.324084 -0.385082
D -0.676922  0.611676  1.031000  0.931280
E -0.839218 -0.309212  0.331263  0.975545

In [70]:
df['W']

A    0.738467
B   -1.478522
C    0.343618
D   -0.676922
E   -0.839218
Name: W, dtype: float64

In [73]:
type(df.loc['A']) # gives a Row as a Series where column names become the labels

pandas.core.series.Series

In [74]:
df.loc['A']

W    0.738467
X    0.171368
Y   -0.115648
Z   -0.301104
Name: A, dtype: float64

In [76]:
df

          W         X         Y         Z
A  0.738467  0.171368 -0.115648 -0.301104
B -1.478522 -0.719844 -0.460639  1.057122
C  0.343618 -1.763040  0.324084 -0.385082
D -0.676922  0.611676  1.031000  0.931280
E -0.839218 -0.309212  0.331263  0.975545

In [78]:
df.iloc[2]

W    0.343618
X   -1.763040
Y    0.324084
Z   -0.385082
Name: C, dtype: float64

In [84]:
df = df[df > 0]
df

          W         X         Y         Z
A  0.738467  0.171368       NaN       NaN
B       NaN       NaN       NaN  1.057122
C  0.343618       NaN  0.324084       NaN
D       NaN  0.611676  1.031000  0.931280
E       NaN       NaN  0.331263  0.975545

In [86]:
df['W'].isnull().sum()

3

In [87]:
df.isnull().sum()

W    3
X    3
Y    2
Z    2
dtype: int64

In [88]:
df.notnull().sum()

W    2
X    2
Y    3
Z    3
dtype: int64

In [90]:
df

          W         X         Y         Z
A  0.738467  0.171368 -0.115648 -0.301104
B -1.478522 -0.719844 -0.460639  1.057122
C  0.343618 -1.763040  0.324084 -0.385082
D -0.676922  0.611676  1.031000  0.931280
E -0.839218 -0.309212  0.331263  0.975545

In [91]:
df[df['W'] > 0] # return a new DtaFrame with matching condition

          W         X         Y         Z
A  0.738467  0.171368 -0.115648 -0.301104
C  0.343618 -1.763040  0.324084 -0.385082

In [94]:
df[df['W'] > 0][['W','X']]

          W         X
A  0.738467  0.171368
C  0.343618 -1.763040

In [95]:
df

          W         X         Y         Z
A  0.738467  0.171368 -0.115648 -0.301104
B -1.478522 -0.719844 -0.460639  1.057122
C  0.343618 -1.763040  0.324084 -0.385082
D -0.676922  0.611676  1.031000  0.931280
E -0.839218 -0.309212  0.331263  0.975545

In [96]:
df[ (df['W'] > 0) & (df['Y'] > 0) ]

          W        X         Y         Z
C  0.343618 -1.76304  0.324084 -0.385082

#### Missing Data

In [98]:
df = pd.DataFrame({
        'A':[1, 2, np.nan],
        'B':[4, np.nan, np.nan],
        'C':[7 , 8, 9]
        })

df

     A    B  C
0  1.0  4.0  7
1  2.0  NaN  8
2  NaN  NaN  9

In [99]:
df.dropna() # drop rows which have at least one missing data

     A    B  C
0  1.0  4.0  7

In [100]:
df.dropna(axis=1) # drop columns which have at least one missing data

   C
0  7
1  8
2  9

In [102]:
df

     A    B  C
0  1.0  4.0  7
1  2.0  NaN  8
2  NaN  NaN  9

In [103]:
df.dropna(thresh=2)  # retain rows which have at least 2 non-null values

     A    B  C
0  1.0  4.0  7
1  2.0  NaN  8

In [104]:
df.dropna(thresh=2, axis=1)

     A  C
0  1.0  7
1  2.0  8
2  NaN  9

In [105]:
df

     A    B  C
0  1.0  4.0  7
1  2.0  NaN  8
2  NaN  NaN  9

In [106]:
df.fillna(0)

     A    B  C
0  1.0  4.0  7
1  2.0  0.0  8
2  0.0  0.0  9

In [109]:
df

     A    B  C
0  1.0  4.0  7
1  2.0  NaN  8
2  NaN  NaN  9

In [110]:
df.fillna(df.mean())

     A    B  C
0  1.0  4.0  7
1  2.0  4.0  8
2  1.5  4.0  9

In [113]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

#### Reading data

In [114]:
df = pd.read_csv('example.csv')
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [116]:
df.to_csv('example2.csv', index=False)
print('CSV File Saved')

CSV File Saved

In [118]:
!pip install openpyxl

Requirement already satisfied: openpyxl in /home/coder/miniconda3/lib/python3.11/site-packages (3.1.2)
Requirement already satisfied: et-xmlfile in /home/coder/miniconda3/lib/python3.11/site-packages (from openpyxl) (1.1.0)

In [119]:
df.to_excel('example.xlsx', sheet_name='My-sheet', index=False)
print('Excel File Saved')

Excel File Saved

In [120]:
df = pd.read_excel('example.xlsx')
df

    a    b    c    d
0   0  100  200  300
1   4    5    6    7
2   8    9   10   11
3  12   13   14   15

In [121]:
!pip install html5lib

Requirement already satisfied: html5lib in /home/coder/miniconda3/lib/python3.11/site-packages (1.1)
Requirement already satisfied: six>=1.9 in /home/coder/miniconda3/lib/python3.11/site-packages (from html5lib) (1.16.0)
Requirement already satisfied: webencodings in /home/coder/miniconda3/lib/python3.11/site-packages (from html5lib) (0.5.1)

In [122]:
!pip install lxml

Requirement already satisfied: lxml in /home/coder/miniconda3/lib/python3.11/site-packages (5.1.0)

In [123]:
# Creates an Array of DataFrames
df_array = pd.read_html('https://www.w3schools.com/html/html_tables.asp')
df_array[0]

                        Company           Contact  Country
0           Alfreds Futterkiste      Maria Anders  Germany
1    Centro comercial Moctezuma   Francisco Chang   Mexico
2                  Ernst Handel     Roland Mendel  Austria
3                Island Trading     Helen Bennett       UK
4  Laughing Bacchus Winecellars   Yoshi Tannamuri   Canada
5  Magazzini Alimentari Riuniti  Giovanni Rovelli    Italy

In [124]:
# Creates an Array of DataFrames
df_array = pd.read_html('https://www.fdic.gov/resources/resolutions/bank-failures/failed-bank-list/')
df_array[0]

,Bank NameBank,CityCity,StateSt,CertCert,Acquiring InstitutionAI,Closing DateClosing,FundFund
0,Citizens Bank,Sac City,IA,8758,Iowa Trust & Savings Bank,"November 3, 2023",10545
1,Heartland Tri-State Bank,Elkhart,KS,25851,"Dream First Bank, N.A.","July 28, 2023",10544
2,First Republic Bank,San Francisco,CA,59017,"JPMorgan Chase Bank, N.A.","May 1, 2023",10543
3,Signature Bank,New York,NY,57053,"Flagstar Bank, N.A.","March 12, 2023",10540
4,Silicon Valley Bank,Santa Clara,CA,24735,First–Citizens Bank & Trust Company,"March 10, 2023",10539
...,...,...,...,...,...,...,...
563,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001",6004
564,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001",4648
565,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001",4647
566,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000",4646
567,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000",4645

In [125]:
df_array[0].shape

(568, 7)

In [127]:
df_array[0].head(10)

,Bank NameBank,CityCity,StateSt,CertCert,Acquiring InstitutionAI,Closing DateClosing,FundFund
0,Citizens Bank,Sac City,IA,8758,Iowa Trust & Savings Bank,"November 3, 2023",10545
1,Heartland Tri-State Bank,Elkhart,KS,25851,"Dream First Bank, N.A.","July 28, 2023",10544
2,First Republic Bank,San Francisco,CA,59017,"JPMorgan Chase Bank, N.A.","May 1, 2023",10543
3,Signature Bank,New York,NY,57053,"Flagstar Bank, N.A.","March 12, 2023",10540
4,Silicon Valley Bank,Santa Clara,CA,24735,First–Citizens Bank & Trust Company,"March 10, 2023",10539
5,Almena State Bank,Almena,KS,15426,Equity Bank,"October 23, 2020",10538
6,First City Bank of Florida,Fort Walton Beach,FL,16748,"United Fidelity Bank, fsb","October 16, 2020",10537
7,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.","April 3, 2020",10536
8,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020",10535
9,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019",10534

In [128]:
df_array[0].tail()

,Bank NameBank,CityCity,StateSt,CertCert,Acquiring InstitutionAI,Closing DateClosing,FundFund
563,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001",6004
564,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001",4648
565,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001",4647
566,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000",4646
567,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000",4645